BelongMin/nrf5_SDK_for_Mesh_v2.1.1_src_el_local/examples/light_switch/provisioner/src/node_setup.c
/* Copyright (c) 2010 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stdarg.h>

#include "nrf_mesh_utils.h"
#include "device_state_manager.h"
#include "timer_scheduler.h"

#include "config_client.h"
#include "config_server.h"
#include "access_config.h"
#include "simple_on_off_server.h"
#include "simple_on_off_client.h"
#include "el_simple_brightness_client.h"
#include "el_simple_brightness_server.h"
#include "el_simple_color_temperature_client.h"
#include "el_simple_color_temperature_server.h"
#include "el_simple_binding_client.h"

#include "health_common.h"

#include "node_setup.h"
#include "example_network_config.h"
#include "light_switch_example_common.h"
#include "mesh_app_utils.h"

#include "log.h"

/* In this example, client node, has 4 on/off client model instances corresponding to each push
button on NRF52 DK */
#define  CLIENT_NODE_ONOFF_CLIENT_MODEL_INSTANCES         (CLIENT_MODEL_INSTANCE_COUNT)

/* USER_NOTE: Add more steps here is you want to customize the nodes further. */
/* Node setup steps */
typedef enum
{
    NODE_SETUP_IDLE,
    NODE_SETUP_CONFIG_COMPOSITION_GET,
    NODE_SETUP_CONFIG_APPKEY_ADD,
    NODE_SETUP_CONFIG_APPKEY_BIND_HEALTH,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_CLIENT,
    NODE_SETUP_CONFIG_APPKEY_BIND_BRIGHTNESS_SERVER,
    NODE_SETUP_CONFIG_APPKEY_BIND_BRIGHTNESS_CLIENT,
    NODE_SETUP_CONFIG_APPKEY_BIND_COLOR_TEMPERATURE_SERVER,
    NODE_SETUP_CONFIG_APPKEY_BIND_COLOR_TEMPERATURE_CLIENT,
    NODE_SETUP_CONFIG_APPKEY_BIND_BINDING_CLIENT,
    NODE_SETUP_CONFIG_PUBLICATION_HEALTH,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER1_2,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT,
//    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT1,
//    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT2,
//    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT3,
//    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT4,
    NODE_SETUP_CONFIG_PUBLICATION_BRIGHTNESS_CLIENT,
    NODE_SETUP_CONFIG_PUBLICATION_COLOR_TEMPERATURE_CLIENT,
    NODE_SETUP_CONFIG_PUBLICATION_BINDING_CLIENT,
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER,
    NODE_SETUP_CONFIG_SUBSCRIPTION_BRIGHTNESS_SERVER,
    NODE_SETUP_CONFIG_SUBSCRIPTION_COLOR_TEMPERATURE_SERVER,
    NODE_SETUP_DONE,
} config_steps_t;

/* Structure to hold the composition data */
typedef struct
{
    uint16_t    len;
    struct
    {
        uint8_t page_number;
        uint8_t data[NRF_MESH_SEG_PAYLOAD_SIZE_MAX];
    }composition;
} composition_data_t;

/* Expected status structure, used for setup state machine */
typedef struct
{
    uint8_t  num_statuses;
    uint16_t expected_opcode;
    const uint8_t  * p_statuses;
} expected_status_list_t;

typedef struct
{
    uint8_t count;
    timer_event_t timer;
} client_send_retry_t;

typedef enum
{
    STATUS_CHECK_PASS,
    STATUS_CHECK_FAIL,
    STATUS_CHECK_UNEXPECTED_OPCODE
} status_check_t;

/* USER_NOTE:
You can define one or more such configuration steps for a given node in your network. The choice
of the steps can be done in @ref setup_select_steps() function.
*/
/* Sequence of steps for the client nodes */
static const config_steps_t client_config_steps[] =
{
    NODE_SETUP_CONFIG_COMPOSITION_GET,
    NODE_SETUP_CONFIG_APPKEY_ADD,
    NODE_SETUP_CONFIG_APPKEY_BIND_HEALTH,
    NODE_SETUP_CONFIG_PUBLICATION_HEALTH,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_CLIENT,
//    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_CLIENT,
//    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_CLIENT,
//    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_CLIENT,
    NODE_SETUP_CONFIG_APPKEY_BIND_BRIGHTNESS_CLIENT,
    NODE_SETUP_CONFIG_APPKEY_BIND_COLOR_TEMPERATURE_CLIENT,
    NODE_SETUP_CONFIG_APPKEY_BIND_BINDING_CLIENT,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT,
//    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT1,
//    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT2,
//    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT3,
//    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT4,
    NODE_SETUP_CONFIG_PUBLICATION_BRIGHTNESS_CLIENT,
    NODE_SETUP_CONFIG_PUBLICATION_COLOR_TEMPERATURE_CLIENT,
    NODE_SETUP_CONFIG_PUBLICATION_BINDING_CLIENT,
    NODE_SETUP_DONE
};

