BelongMin/nrf5_SDK_for_Mesh_v2.1.1_src_el_local/examples/light_switch/provisioner/src/node_setup.c
    switch (*mp_config_step)
    {
        /* Read the composition data from the node: */
        case NODE_SETUP_CONFIG_COMPOSITION_GET:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Getting composition data\n");
            retry_on_fail(config_client_composition_data_get(0x00));

            expected_status_set(CONFIG_OPCODE_COMPOSITION_DATA_STATUS, 0, NULL);
            break;
        }

        /* Add the application key to the node: */
        case NODE_SETUP_CONFIG_APPKEY_ADD:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Adding appkey\n");
            retry_on_fail(config_client_appkey_add(NETKEY_INDEX, m_appkey_idx, mp_appkey));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS, ACCESS_STATUS_KEY_INDEX_ALREADY_STORED};
            expected_status_set(CONFIG_OPCODE_APPKEY_STATUS, sizeof(exp_status), exp_status);
            break;
        }

        /* Bind the health server to the application key: */
        case NODE_SETUP_CONFIG_APPKEY_BIND_HEALTH:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: Health server\n");
            access_model_id_t model_id;
            model_id.company_id = ACCESS_COMPANY_ID_NONE;
            model_id.model_id = HEALTH_SERVER_MODEL_ID;
            uint16_t element_address = m_current_node_addr;
            retry_on_fail(config_client_model_app_bind(element_address, m_appkey_idx, model_id));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, sizeof(exp_status), exp_status);
            break;
        }

        /* Bind the On/Off server to the application key: */
        case NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: Simple On/Off server\n");
            access_model_id_t model_id;
            model_id.company_id = ACCESS_COMPANY_ID_NORDIC;
            model_id.model_id = SIMPLE_ON_OFF_SERVER_MODEL_ID;
            uint16_t element_address = m_current_node_addr;
            retry_on_fail(config_client_model_app_bind(element_address, m_appkey_idx, model_id));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, sizeof(exp_status), exp_status);
            break;
        }

        /* Bind the Brightness server to the application key: */
        case NODE_SETUP_CONFIG_APPKEY_BIND_BRIGHTNESS_SERVER:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: Simple Brightness server\n");
            access_model_id_t model_id;
            model_id.company_id = ACCESS_COMPANY_ID_NORDIC;
            model_id.model_id = EL_SIMPLE_BRIGHTNESS_SERVER_MODLE_ID;
            uint16_t element_address = m_current_node_addr + 1;
            retry_on_fail(config_client_model_app_bind(element_address, m_appkey_idx, model_id));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, sizeof(exp_status), exp_status);
            break;
        }

        /* Bind the Color Temperature server to the application key: */
        case NODE_SETUP_CONFIG_APPKEY_BIND_COLOR_TEMPERATURE_SERVER:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: Simple Brightness server\n");
            access_model_id_t model_id;
            model_id.company_id = ACCESS_COMPANY_ID_NORDIC;
            model_id.model_id = EL_SIMPLE_COLOR_TEMPERATURE_SERVER_MODLE_ID;
            uint16_t element_address = m_current_node_addr + 2;
            retry_on_fail(config_client_model_app_bind(element_address, m_appkey_idx, model_id));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, sizeof(exp_status), exp_status);
            break;
        }

        /* Bind the On/Off client to the application key: */
        case NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_CLIENT:
        {
//            if (model_element_addr == 0 || model_element_addr == m_current_node_addr)
//            {
                model_element_addr = m_current_node_addr + 1;
//            }
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: Simple On/Off client on element 0x%04x\n", model_element_addr);
            access_model_id_t model_id;
            model_id.company_id = ACCESS_COMPANY_ID_NORDIC;
            model_id.model_id = SIMPLE_ON_OFF_CLIENT_MODEL_ID;
            uint16_t element_address = model_element_addr;
            status = config_client_model_app_bind(element_address, m_appkey_idx, model_id);
            retry_on_fail(status);

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, sizeof(exp_status), exp_status);

//            if (status == NRF_SUCCESS)
//            {
//                model_element_addr++;
//            }
            break;
        }

        /* Bind the Brightness client to the application key: */
        case NODE_SETUP_CONFIG_APPKEY_BIND_BRIGHTNESS_CLIENT:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: Simple Brightness client on element 0x%04x\n", model_element_addr);
            access_model_id_t model_id;
            model_id.company_id = ACCESS_COMPANY_ID_NORDIC;
            model_id.model_id = EL_SIMPLE_BRIGHTNESS_MODEL_CLIENT_ID;
            uint16_t element_address = m_current_node_addr + 2;
            status = config_client_model_app_bind(element_address, m_appkey_idx, model_id);
//            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Simple Brightness client bind status 0x%04x\n", status);
            retry_on_fail(status);

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, sizeof(exp_status), exp_status);
            break;
        }

        /* Bind the Color Temperature client to the application key: */
        case NODE_SETUP_CONFIG_APPKEY_BIND_COLOR_TEMPERATURE_CLIENT:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: Simple Color Temperature client on element 0x%04x\n", model_element_addr);
            access_model_id_t model_id;
            model_id.company_id = ACCESS_COMPANY_ID_NORDIC;
            model_id.model_id = EL_SIMPLE_COLOR_TEMPERATURE_MODEL_CLIENT_ID;
            uint16_t element_address = m_current_node_addr + 3;
            status = config_client_model_app_bind(element_address, m_appkey_idx, model_id);
//            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Simple Color Temperature client bind status 0x%04x\n", status);
            retry_on_fail(status);

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, sizeof(exp_status), exp_status);
            break;
        }

        
        /* Bind the Binding client to the application key: */
        case NODE_SETUP_CONFIG_APPKEY_BIND_BINDING_CLIENT:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: Simple Binding client on element 0x%04x\n", model_element_addr);
            access_model_id_t model_id;
            model_id.company_id = ACCESS_COMPANY_ID_NORDIC;
            model_id.model_id = EL_SIMPLE_BINDING_MODEL_CLIENT_ID;
            uint16_t element_address = m_current_node_addr;
            status = config_client_model_app_bind(element_address, m_appkey_idx, model_id);
            retry_on_fail(status);

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, sizeof(exp_status), exp_status);
            break;
        }

        /* Configure the publication parameters for the Health server: */
        case NODE_SETUP_CONFIG_PUBLICATION_HEALTH:
        {
            config_publication_state_t pubstate = {0};
            pubstate.element_address = m_current_node_addr;
            pubstate.publish_address.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
            pubstate.publish_address.value = PROVISIONER_ADDRESS;
            pubstate.appkey_index = 0;
            pubstate.frendship_credential_flag = false;
            pubstate.publish_ttl = (SERVER_NODE_COUNT > NRF_MESH_TTL_MAX ? NRF_MESH_TTL_MAX : SERVER_NODE_COUNT);
            pubstate.publish_period.step_num = 1;
            pubstate.publish_period.step_res = ACCESS_PUBLISH_RESOLUTION_10S;
            pubstate.retransmit_count = 1;
            pubstate.retransmit_interval = 0;
            pubstate.model_id.company_id = ACCESS_COMPANY_ID_NONE;
            pubstate.model_id.model_id = HEALTH_SERVER_MODEL_ID;
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Setting publication address for the health server to 0x%04x\n", pubstate.publish_address.value);
            retry_on_fail(config_client_model_publication_set(&pubstate));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, sizeof(exp_status), exp_status);
            break;
        }

        /* Configure the publication parameters for the 1st two On/Off servers to publish to
        corresponding On/Off clients. This demonstrates the state change publication due to local
        event on the server. */
        case NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER1_2:
        {
            config_publication_state_t pubstate = {0};
            pubstate.element_address = m_current_node_addr;
            pubstate.publish_address.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
            pubstate.publish_address.value = m_current_node_addr - CLIENT_NODE_ONOFF_CLIENT_MODEL_INSTANCES;
            pubstate.appkey_index = m_appkey_idx;
            pubstate.frendship_credential_flag = false;
            pubstate.publish_ttl = (SERVER_NODE_COUNT > NRF_MESH_TTL_MAX ? NRF_MESH_TTL_MAX : SERVER_NODE_COUNT);
            pubstate.publish_period.step_num = 0;
            pubstate.publish_period.step_res = ACCESS_PUBLISH_RESOLUTION_100MS;
            pubstate.retransmit_count = 1;
            pubstate.retransmit_interval = 0;
            pubstate.model_id.company_id = ACCESS_COMPANY_ID_NORDIC;
            pubstate.model_id.model_id = SIMPLE_ON_OFF_SERVER_MODEL_ID;
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Set: on/off server pub addr: 0x%04x\n", pubstate.publish_address.value);
            retry_on_fail(config_client_model_publication_set(&pubstate));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, sizeof(exp_status), exp_status);
            break;
        }

        /* Configure subscription address for the On/Off server */
        case NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Adding subscription\n");
            uint16_t element_address = m_current_node_addr;
            nrf_mesh_address_t address = {NRF_MESH_ADDRESS_TYPE_INVALID, 0, NULL};
            address.type = NRF_MESH_ADDRESS_TYPE_GROUP;
//            if (m_current_node_addr % 0x02)
//            {
//                address.value  = GROUP_ADDRESS_ODD;
//            }
//            else
//            {
//                address.value  = GROUP_ADDRESS_EVEN;
//            }
            address.value  = m_config_current_group;
            access_model_id_t model_id;
            model_id.company_id = ACCESS_COMPANY_ID_NORDIC;
            model_id.model_id = SIMPLE_ON_OFF_SERVER_MODEL_ID;
            retry_on_fail(config_client_model_subscription_add(element_address, address, model_id));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_SUBSCRIPTION_STATUS, sizeof(exp_status), exp_status);
            break;
        }

