BelongMin/nrf5_SDK_for_Mesh_v2.1.1_src_el_local/examples/light_switch/provisioner/src/node_setup.c
        /* Configure subscription address for the Brightness server */
        case NODE_SETUP_CONFIG_SUBSCRIPTION_BRIGHTNESS_SERVER:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Adding subscription BRIGHTNESS_SERVER\n");
            uint16_t element_address = m_current_node_addr + 1;
            nrf_mesh_address_t address = {NRF_MESH_ADDRESS_TYPE_INVALID, 0, NULL};
            address.type = NRF_MESH_ADDRESS_TYPE_GROUP;
            address.value  = m_config_current_group;

            access_model_id_t model_id;
            model_id.company_id = ACCESS_COMPANY_ID_NORDIC;
            model_id.model_id = EL_SIMPLE_BRIGHTNESS_SERVER_MODLE_ID;
            retry_on_fail(config_client_model_subscription_add(element_address, address, model_id));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_SUBSCRIPTION_STATUS, sizeof(exp_status), exp_status);
            break;
        }

        /* Configure subscription address for the Color Temperature server */
        case NODE_SETUP_CONFIG_SUBSCRIPTION_COLOR_TEMPERATURE_SERVER:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Adding subscription Color Temperature\n");
            uint16_t element_address = m_current_node_addr + 2;
            nrf_mesh_address_t address = {NRF_MESH_ADDRESS_TYPE_INVALID, 0, NULL};
            address.type = NRF_MESH_ADDRESS_TYPE_GROUP;
            address.value  = m_config_current_group;

            access_model_id_t model_id;
            model_id.company_id = ACCESS_COMPANY_ID_NORDIC;
            model_id.model_id = EL_SIMPLE_COLOR_TEMPERATURE_SERVER_MODLE_ID;
            retry_on_fail(config_client_model_subscription_add(element_address, address, model_id));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_SUBSCRIPTION_STATUS, sizeof(exp_status), exp_status);
            break;
        }

        /* Configure the 1st client model to 1st server */
        case NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT:
        {
            config_publication_state_t pubstate = {0};
            client_pub_state_set(&pubstate, m_current_node_addr + ELEMENT_IDX_ONOFF_CLIENT1, m_config_current_group);
            retry_on_fail(config_client_model_publication_set(&pubstate));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, sizeof(exp_status), exp_status);
            break;
        }

        /* Configure the 1st client model to 1st server */
        /*
        case NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT1:
        {
            config_publication_state_t pubstate = {0};
//            client_pub_state_set(&pubstate, m_current_node_addr + ELEMENT_IDX_ONOFF_CLIENT1,
//                                 UNPROV_START_ADDRESS + CLIENT_NODE_ONOFF_CLIENT_MODEL_INSTANCES + ELEMENT_IDX_ONOFF_CLIENT1);
            client_pub_state_set(&pubstate, m_current_node_addr + ELEMENT_IDX_ONOFF_CLIENT1, m_config_current_group);
            retry_on_fail(config_client_model_publication_set(&pubstate));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, sizeof(exp_status), exp_status);
            break;
        }

        case NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT2:
        {
            config_publication_state_t pubstate = {0};
//            client_pub_state_set(&pubstate, m_current_node_addr + ELEMENT_IDX_ONOFF_CLIENT2,
//                                 UNPROV_START_ADDRESS + CLIENT_NODE_ONOFF_CLIENT_MODEL_INSTANCES + ELEMENT_IDX_ONOFF_CLIENT2);
            client_pub_state_set(&pubstate, m_current_node_addr + ELEMENT_IDX_ONOFF_CLIENT2, m_config_current_group);
            retry_on_fail(config_client_model_publication_set(&pubstate));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, sizeof(exp_status), exp_status);
            break;
        }

        case NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT3:
        {
            config_publication_state_t pubstate = {0};
//            client_pub_state_set(&pubstate,
//                                 m_current_node_addr + ELEMENT_IDX_ONOFF_CLIENT3,
//                                 GROUP_ADDRESS_ODD);
            client_pub_state_set(&pubstate, m_current_node_addr + ELEMENT_IDX_ONOFF_CLIENT3, m_config_current_group);
            retry_on_fail(config_client_model_publication_set(&pubstate));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, sizeof(exp_status), exp_status);
            break;
        }

        case NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT4:
        {
            config_publication_state_t pubstate = {0};
//            client_pub_state_set(&pubstate,
//                                 m_current_node_addr + ELEMENT_IDX_ONOFF_CLIENT4,
//                                 GROUP_ADDRESS_EVEN);
            client_pub_state_set(&pubstate, m_current_node_addr + ELEMENT_IDX_ONOFF_CLIENT4, m_config_current_group);
            retry_on_fail(config_client_model_publication_set(&pubstate));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, sizeof(exp_status), exp_status);
            break;
        }
        */
        case NODE_SETUP_CONFIG_PUBLICATION_BRIGHTNESS_CLIENT:
        {
            if(m_is_binding_mode) m_config_current_group++;
            config_publication_state_t pubstate = {0};
            brightness_client_pub_state_set(&pubstate,
                                 m_current_node_addr + 2,
                                 m_config_current_group);
            retry_on_fail(config_client_model_publication_set(&pubstate));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, sizeof(exp_status), exp_status);
            break;
        }

        case NODE_SETUP_CONFIG_PUBLICATION_COLOR_TEMPERATURE_CLIENT:
        {
            if(m_is_binding_mode) m_config_current_group++;
            config_publication_state_t pubstate = {0};
            color_temperature_client_pub_state_set(&pubstate,
                                 m_current_node_addr + 3,
                                 m_config_current_group);
            retry_on_fail(config_client_model_publication_set(&pubstate));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, sizeof(exp_status), exp_status);
            break;
        }
        
        case NODE_SETUP_CONFIG_PUBLICATION_BINDING_CLIENT:
        {
            config_publication_state_t pubstate = {0};
            binding_client_pub_state_set(&pubstate,
                                 m_current_node_addr,
                                 PROVISIONER_ADDRESS);
            retry_on_fail(config_client_model_publication_set(&pubstate));

            static const uint8_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, sizeof(exp_status), exp_status);
            model_element_addr = 0;
            break;
        }
        default:
            ERROR_CHECK(NRF_ERROR_NOT_FOUND);
            break;
    }
}

/**
 * This function retrieves the device key for the given address, and configures the tx and rx paths
 * of the config client model.
 */
static void setup_config_client(uint16_t target_addr)
{
    dsm_handle_t        addr_handle = DSM_HANDLE_INVALID;
    dsm_handle_t        devkey_handle = DSM_HANDLE_INVALID;
    nrf_mesh_address_t  addr;

    addr.type  = NRF_MESH_ADDRESS_TYPE_UNICAST;
    addr.value = target_addr;

    /* Provisioner helper has stored address and device keys already. Retrieve them. */
    ERROR_CHECK(dsm_address_handle_get(&addr, &addr_handle));
    ERROR_CHECK(dsm_devkey_handle_get(addr.value, &devkey_handle));

    /* Configure client to communicate with server at the given address */
    ERROR_CHECK(config_client_server_bind(devkey_handle));
    ERROR_CHECK(config_client_server_set(devkey_handle, addr_handle));
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Config client setup: devkey_handle:%d addr_handle:%d\n", devkey_handle, addr_handle);
}


/*************************************************************************************************/
/* Public functions */

/**
 * Proccess the config client model events, and advances the node setup state machine to the next
 * state, if expected status message is received.
 */
void node_setup_config_client_event_process(config_client_event_type_t event_type,
                                        const config_client_event_t * p_event,
                                        uint16_t length)
{
    status_check_t status;

    if (event_type == CONFIG_CLIENT_EVENT_TYPE_TIMEOUT)
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Acknowledged message status not received \n");

        if (m_retry_count)
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Retry ...\n");
            m_retry_count--;
            config_step_execute();
        }
        else
        {
            mp_config_step = &m_idle_step;
            m_node_setup_failed_cb();
        }
    }
    else if (event_type == CONFIG_CLIENT_EVENT_TYPE_MSG && *mp_config_step != NODE_SETUP_DONE
             && m_status_checked == false)
    {
        NRF_MESH_ASSERT(p_event != NULL);
        status = check_expected_status(p_event->opcode, p_event->p_msg);
        if (status == STATUS_CHECK_PASS)
        {
            /* Save composition data for later use */
            if (p_event->opcode == CONFIG_OPCODE_COMPOSITION_DATA_STATUS)
            {
                m_node_composition.len  = length;
                m_node_composition.composition.page_number = p_event->p_msg->composition_data_status.page_number;
                memcpy(m_node_composition.composition.data, p_event->p_msg->composition_data_status.data, length - 1);
            }

            mp_config_step++;
            if (*mp_config_step == NODE_SETUP_DONE)
            {
                mp_config_step = &m_idle_step;
                
                if(m_is_binding_mode) m_is_binding_mode = false;
                m_node_setup_success_cb();
            }
            else
            {
                m_send_timer.count = CLIENT_BUSY_SEND_RETRY_LIMIT;
                config_step_execute();
            }
        }
        else if (status == STATUS_CHECK_FAIL)
        {
            mp_config_step = &m_idle_step;
            m_node_setup_failed_cb();
        }
    }
}

/**
 * Begins the node setup process.
 */
void node_setup_start(uint16_t address, uint8_t  retry_cnt, const uint8_t * p_appkey,
                      uint16_t appkey_idx, const uint8_t *p_in_uuid)
{
    if (*mp_config_step != NODE_SETUP_IDLE)
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR, "Cannot start. Node setup procedure is in progress.\n");
        return;
    }
    m_current_node_addr = address;
    m_retry_count = retry_cnt;
    m_send_timer.timer.cb = client_send_timer_cb;
    m_send_timer.count = CLIENT_BUSY_SEND_RETRY_LIMIT;
    mp_appkey = p_appkey;
    m_appkey_idx = appkey_idx;

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Configuring Node: 0x%04X\n", m_current_node_addr);

     setup_config_client(m_current_node_addr);
//    setup_select_steps(m_current_node_addr);
    const uint8_t m_client_uuid_filter[SERVER_NODE_UUID_PREFIX_SIZE] = CLIENT_NODE_UUID_PREFIX;
    const uint8_t m_server_uuid_filter[SERVER_NODE_UUID_PREFIX_SIZE] = SERVER_NODE_UUID_PREFIX;
//    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "p_in_uuid %x %x %x %x\n", p_in_uuid[0], p_in_uuid[1], p_in_uuid[2], p_in_uuid[3]);
    if (memcmp(&p_in_uuid[0], m_client_uuid_filter, SERVER_NODE_UUID_PREFIX_SIZE) == 0)
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "CLIENT_NODE_UUID_PREFIX\n");
        mp_config_step = client_config_steps;
    }
    else if (memcmp(&p_in_uuid[0], m_server_uuid_filter, SERVER_NODE_UUID_PREFIX_SIZE) == 0)
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "SERVER_NODE_UUID_PREFIX\n");
        mp_config_step = server_config_steps;
    }
    config_step_execute();
}

/**
 * Begins the node setup process.
 */
void node_binding_start(uint16_t address, uint16_t rx_address, uint8_t  retry_cnt, const uint8_t * p_appkey,
                      uint16_t appkey_idx)
{
    if (*mp_config_step != NODE_SETUP_IDLE)
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR, "Cannot start. Node setup procedure is in progress.\n");
        return;
    }
    m_config_current_group = rx_address;

    m_current_node_addr = address;
    m_retry_count = retry_cnt;
    m_send_timer.timer.cb = client_send_timer_cb;
    m_send_timer.count = CLIENT_BUSY_SEND_RETRY_LIMIT;
    mp_appkey = p_appkey;
    m_appkey_idx = appkey_idx;

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Binding Node: 0x%04X\n", m_current_node_addr);

    setup_config_client(m_current_node_addr);

    mp_config_step = binding_config_steps;
    m_is_binding_mode = true;
    config_step_execute();
}

void node_setup_cb_set(node_setup_successful_cb_t config_success_cb,
                       node_setup_failed_cb_t config_failed_cb)
{
    NRF_MESH_ASSERT(config_success_cb != NULL);
    NRF_MESH_ASSERT(config_failed_cb != NULL);

    m_node_setup_success_cb = config_success_cb;
    m_node_setup_failed_cb = config_failed_cb;
}
